<?php
declare(strict_types = 1);

namespace WhereIsMyTeacherBot\Dictionary;

use WhereIsMyTeacherBot\Entity\FreeChoiceSubjectSearch;

/**
 * Class FreeChoiceSubjectDictionary
 *
 * @package WhereIsMyTeacherBot\Dictionary
 */
final class FreeChoiceSubjectDictionary
{
    private const TEACHERS_SCHEDULE_FIRST_WEEK = [
        'Понеділок' => [
            ['08:30', 'Основи кібербезпеки', 'Лобанчикова Н.М.', '250', 'лекція', 'ОКБ-1, ОКБ-2, ОКБ-3, ОКБ-4',],
            ['08:30', 'Коштовне та декоративне каміння', 'Ремезова О.О.', '312', 'практика', 'КДК-1',],
            ['08:30', 'Веб-дизайн	Лисогор Ю.І.', '104', 'практика', 'ВЕБ-1',],
            ['08:30', 'Основи екологічної безпеки', 'Коцюба І.Г.', '318', 'практика', 'ОЕБ-1',],
            ['08:30', 'Логістика', 'Вітюк І.В.', '232', 'практика', 'ЛОГ-1',],
            ['08:30', 'Управління бізнесом', 'Орлова К.Є.', '315', 'практика', 'УБІЗ-3',],
            ['10:00', 'Основи кібербезпеки', 'Байлюк Є.М.', '103', 'практика', 'ОКБ-4',],
            ['10:00', 'Логістика', 'Вітюк І.В.', '244', 'лекція', 'ЛОГ-1, ЛОГ-2',],
            ['10:00',
                'Поведінкова економіка: як робити правильний вибір',
                'Бондарчук В.В.',
                '319',
                'практика',
                'ПЕ-1',],
            ['10:00', 'Географічні інформаційні системи', 'Панасюк А.В.', '306', 'практика', 'ГІС-2',],
            ['10:00', 'Веб-дизайн', 'Лисогор Ю.І.', '104', 'практика', 'ВЕБ-2',],
            ['10:00', 'Тайм-менеджмент', 'Бурачек І.В.', '317', 'практика', 'ТМ-5',],
            ['10:00', 'Ораторське мистецтво', 'Саннікова С.Б.', '325', 'практика', 'ОМ-3',],
            ['10:00', 'Управління бізнесом', 'Орлова К.Є.', '230', 'практика', 'УБІЗ-4',],
            ['10:00', 'Управління конфліктами', 'Ткачук В.О.', '426', 'практика', 'УКОН-2',],
            ['11:40', 'Тайм-менеджмент', 'Бурачек І.В.', '401', 'лекція', 'ТМ-1, ТМ-2, ТМ-3, ТМ-4, ТМ-5',],
            ['11:40', 'Польська мова', 'Хоменко Г.Ю.', '317', 'практика', 'ПМ-5',],
            ['11:40', 'Веб-дизайн	Лисогор Ю.І.', '104', 'практика', 'ВЕБ-3',],
            ['11:40', 'Основи екологічної безпеки', 'Коцюба І.Г.', '318', 'практика', 'ОЕБ-2',],
            ['11:40', 'Логістика', 'Вітюк І.В.', '232', 'практика', 'ЛОГ-2',],
            ['11:40', 'Управління бізнесом', 'Орлова К.Є.', '319', 'практика', 'УБІЗ-2',],
        ],
        'Вівторок' => [
            ['08:30', 'Основи екологічної безпеки', 'Коцюба І.Г.', 318, 'лекція', 'ОЕБ-1, ОЕБ-2',],
            ['08:30', 'Веб-дизайн', 'Лисогор Ю.І.', 250, 'лекція', 'ВЕБ-1, ВЕБ-2, ВЕБ-3',],
            ['08:30', 'Social English Studies', 'Ковальчук І.С.', 417, 'практика', 'SES-1',],
            ['08:30', 'Social English Studies', 'Сивак О.Б.', 320, 'практика', 'SES-2',],
            ['08:30', 'Польська мова', 'Ксендзук В.В.', 230, 'практика', 'ПМ-1',],
            ['08:30', 'Польська мова', 'Хоменко Г.Ю.', 315, 'практика', 'ПМ-2',],
            ['08:30', 'Основи мережевих ІТ технологій', 'Морозов Д.С.', 104, 'практика', 'ОМІТ-1',],
        ],
        'Середа' =>
            [
                ['08:30', 'Управління бізнесом', 'Орлова К.Є.', 401, 'лекція', 'УБІЗ-1, УБІЗ-2, УБІЗ-3, УБІЗ-4',],
                ['08:30', 'Польська мова', 'Хоменко Г.Ю.', 315, 'практика', 'ПМ-6',],
                ['08:30', 'Social English Studies', 'Сивак О.Б.', 320, 'практика', 'SES-5',],
                ['08:30',
                    'Поведінкова економіка: як робити правильний вибір',
                    'Бондарчук В.В.',
                    317,
                    'практика',
                    'ПЕ-3',],
                ['08:30', 'Теорія корупції та антикорупційна діяльність', 'Яцик С.П.', 319, 'практика', 'ТК-1',],
                ['08:30', 'Тайм-менеджмент', 'Бурачек І.В.', 325, 'практика', 'ТМ-1',],
                ['08:30', 'Основи мережевих ІТ технологій', 'Морозов Д.С.', 104, 'практика', 'ОМІТ-2',],
            ],
        'Четвер' => [
            ['08:30', 'Ораторське мистецтво', 'Саннікова С.Б.', 401, 'лекція', 'ОМ-1, ОМ-2, ОМ-3, ОМ-4',],
            ['08:30', 'Social English Studies', 'Ковальчук І.С.', 417, 'практика', 'SES-3',],
            ['08:30', 'Social English Studies', 'Сивак О.Б.', 320, 'практика', 'SES-4',],
            ['08:30', 'Польська мова', 'Ксендзук В.В.', 315, 'практика', 'ПМ-3',],
            ['08:30', 'Польська мова', 'Хоменко Г.Ю.', 317, 'практика', 'ПМ-4',],
            ['08:30', 'Теорія корупції та антикорупційна діяльність', 'Яцик С.П.', 319, 'практика', 'ТК-2',],
            ['08:30', 'Основи мережевих ІТ технологій', 'Морозов Д.С.', 104, 'практика', 'ОМІТ-3',],
        ],
    ];

    private const TEACHERS_SCHEDULE_SECOND_WEEK = [
        'Понеділок' => [
            ['08:30', 'Коштовне та декоративне каміння', 'Ремезова О.О.', 312, 'практика', 'КДК-2',],
            ['08:30', 'Фінанси', 'Александрова М.М.', 230, 'лекція', 'ФІН',],
            ['08:30', 'Комп`ютерне моделювання теплофізичних процесів', 'Мельник О.Л.', 232, 'лекція', 'КМТП',],
            ['10:00', 'Коштовне та декоративне каміння', 'Ремезова О.О.', 312, 'лекція', 'КДК-1, КДК-2',],
            ['10:00', 'Фінанси', 'Александрова М.М.', 230, 'практика', 'ФІН',],
            ['10:00', 'Комп`ютерне моделювання теплофізичних процесів', 'Соловйов А.В.', 232, 'практика', 'КМТП',],
            ['10:00', 'Social English Studies', 'Ковальчук І.С.', 417, 'практика', 'SES-1',],
            ['10:00', 'Social English Studies', 'Сивак О.Б.', 117, 'практика', 'SES-2',],
            ['10:00', 'Польська мова', 'Ксендзук В.В.', 317, 'практика', 'ПМ-1',],
            ['10:00', 'Польська мова', 'Хоменко Г.Ю.', 319, 'практика', 'ПМ-2',],
            ['10:00', 'Управління конфліктами', 'Ткачук В.О.', 423, 'практика', 'УКОН-1',],
            ['10:00', 'Тайм-менеджмент', 'Бурачек І.В.', 325, 'практика', 'ТМ-2',],
        ],
        'Вівторок' =>
            [
                ['08:30', 'Інтелектуальні мехатронні системи', 'Богдановський М.В.', 120, 'лекція', 'ІМС',],
                ['08:30',
                    'Теоретичні основи методу скінченних елементів та його реалізація в SolidWorks',
                    'Москвін П.П.',
                    232,
                    'лекція',
                    'ТОМ',],
                ['08:30', 'Географічні інформаційні системи', 'Панасюк А.В.', 306, 'практика', 'ГІС-1',],
                ['08:30',
                    'Поведінкова економіка: як робити правильний вибір',
                    'Бондарчук В.В.',
                    315,
                    'практика',
                    'ПЕ-2',],
                ['10:00', 'Географічні інформаційні системи', 'Панасюк А.В.', 244, 'лекція', 'ГІС-1, ГІС-2',],
                ['10:00',
                    'Теоретичні основи методу скінченних елементів та його реалізація в SolidWorks',
                    'Мельник О.Л.',
                    232,
                    'практика',
                    'ТОМ',],
                ['10:00', 'Інтелектуальні мехатронні системи', 'Богдановський М.В.', 120, 'практика', 'ІМС',],
                ['10:00',
                    'Поведінкова економіка: як робити правильний вибір',
                    'Бондарчук В.В.',
                    317,
                    'лекція',
                    'ПЕ-1, ПЕ-2, ПЕ-3',],
                ['10:00',
                    'Польська мова',
                    'Хоменко Г.Ю.',
                    319,
                    'практика',
                    'ПМ-5',],
                ['10:00', 'Основи кібербезпеки', 'Байлюк Є.М.', 107, 'практика', 'ОКБ-2',],
                ['10:00', 'Ораторське мистецтво', 'Саннікова С.Б.', 325, 'практика', 'ОМ-1',],
                ['10:00', 'Управління конфліктами', 'Ткачук В.О.', 227, 'практика', 'УКОН-3',],
                ['10:00', 'Управління бізнесом', 'Орлова К.Є.', 230, 'практика', 'УБІЗ-1',],
            ],
        'Середа' => [
            ['08:30',
                'Основи мережевих ІТ технологій',
                'Морозов Д.С.',
                250,
                'лекція',
                'ОМІТ-1, ОМІТ-2, ОМІТ-3, ОМІТ-4',],
            ['08:30', 'Теорія корупції та антикорупційна діяльність', 'Яцик С.П.', 244, 'лекція', 'ТК-1, ТК-2',],
            ['08:30', 'Польська мова', 'Хоменко Г.Ю.', 315, 'практика', 'ПМ-6',],
            ['08:30', 'Social English Studies', 'Сивак О.Б.', 117, 'практика', 'SES-5',],
            ['08:30', 'Тайм-менеджмент', 'Бурачек І.В.', 317, 'практика', 'ТМ-3',],
            ['08:30', 'Основи кібербезпеки', 'Покотило О.А.', 107, 'практика', 'ОКБ-3',],
            ['08:30', 'Ораторське мистецтво', 'Саннікова С.Б.', 325, 'практика', 'ОМ-2',],
        ],
        'Четвер' => [
            ['08:30', 'Управління конфліктами', 'Богоявленська Ю.В.', 244, 'лекція', 'УКОН-1, УКОН-2, УКОН-3',],
            ['08:30', 'Social English Studies', 'Ковальчук І.С.', 417, 'практика', 'SES-3',],
            ['08:30', 'Social English Studies', 'Сивак О.Б.', 117, 'практика', 'SES-4',],
            ['08:30', 'Польська мова', 'Ксендзук В.В.', 315, 'практика', 'ПМ-3',],
            ['08:30', 'Польська мова', 'Хоменко Г.Ю.', 317, 'практика', 'ПМ-4',],
            ['08:30', 'Тайм-менеджмент', 'Бурачек І.В.', 319, 'практика', 'ТМ-4',],
            ['08:30', 'Основи мережевих ІТ технологій', 'Морозов Д.С.', 104, 'практика', 'ОМІТ-4',],
            ['08:30', 'Основи кібербезпеки', 'Покотило О.А.', 107, 'практика', 'ОКБ-1',],
            ['08:30', 'Ораторське мистецтво', 'Саннікова С.Б.', 325, 'практика', 'ОМ-4',],
        ],
    ];

    /**
     * @param FreeChoiceSubjectSearch $choiceSubjectSearch
     *
     * @return null|string
     */
    public static function getSubjectByFreeChoiceSearchEntity(FreeChoiceSubjectSearch $choiceSubjectSearch): ?string
    {
        $lessons = self::TEACHERS_SCHEDULE_FIRST_WEEK;

        if ($choiceSubjectSearch->getWeek() === 'ІІ тиждень') {
            $lessons = self::TEACHERS_SCHEDULE_SECOND_WEEK;
        }

        $lessons = $lessons[$choiceSubjectSearch->getDay()];

        $lessons = array_filter($lessons, function ($lesson) use ($choiceSubjectSearch) {

            return $choiceSubjectSearch->getStartAt() === $lesson[0]
                && $choiceSubjectSearch->getTeacher() === $lesson[2];
        });

        if ($lesson = reset($lessons)) {
            return $lesson[5] . PHP_EOL . $lesson[1];
        }

        return null;
    }
}
