<?php
declare(strict_types = 1);

namespace Longman\TelegramBot\Commands\SystemCommands;

use Longman\TelegramBot\Commands\SystemCommand;
use Longman\TelegramBot\Entities\Keyboard;
use Longman\TelegramBot\Entities\Message;
use Longman\TelegramBot\Entities\Update;
use Longman\TelegramBot\Request;
use Longman\TelegramBot\Telegram;
use WhereIsMyTeacherBot\Service\TeacherService;

/**
 * Class GenericmessageCommand
 * @package Longman\TelegramBot\Commands\SystemCommands
 */
class GenericmessageCommand extends SystemCommand
{
    /**
     * @var TeacherService
     */
    protected $teacherService;

    /**
     * @var string
     */
    protected $name = 'Generic';

    /**
     * @var string
     */
    protected $version = '0.0.1';

    /**
     * GenericmessageCommand constructor.
     *
     * @param Telegram    $telegram
     * @param Update|null $update
     */
    public function __construct(Telegram $telegram, Update $update = null)
    {
        parent::__construct($telegram, $update);
        $this->teacherService = new TeacherService();
    }

    /**
     * Command execute method
     *
     * @return \Longman\TelegramBot\Entities\ServerResponse
     * @throws \Longman\TelegramBot\Exception\TelegramException
     */
    public function execute()
    {
        $message = $this->getMessage();
        $answer = 'Вибачте, я не розумію вас. Команда /help допоможе вам';

        $teachers = [
            'Давидович М.С.',
            'Канчура Є.О.',
            'Кобзар С.К.',
            'Ковальчук І.С.',
            'Колодій О.А.',
            'Крушинська Н.І.',
            'Кур\'ята С.Г.',
            'Курносова Н.О.',
            'Мельниченко І.С.',
            'Могельницька Л.Ф.',
            'Сивак О.Б.',
            'Суховецька С.В.',
            'Фурсова Л.І.',
            'Шадура В.А.',

            // кафедра екології
            'Вінічук М.М.',
            'Герасимчук О.Л.',
            'Давидова І.В.',
            'Єльнікова Т.О.',
            'Корбут М.Б.',
            'Коцюба І.Г.',
            'Краснов В.П.',
            'Курбет Т.В.',
            'Мандро Ю.Н.',
            'Скиба Г.В.',
            'Шелест З.М.',

            // Кафедра маркшейдерії
            'Башинська М.Е.',
            'Іськов С.С.',
            'Клеван О.М.',
            'Ковалевич Л.А.',
            'Котенко В.В.',
            'Криворучко А.О.',
            'Левицький В.Г.',
            'Мамрай В.В.',
            'Панасюк А.В.',
            'Соболевський Р.В.',

            // Кафедра розробки родовищ корисних копалин ім. проф. Бакка М.Т.
            'Башинський С.І.',
            'Камських О.В.',
            'Колодій М.А.',
            'Остафійчук Н.М.',
            'Підвисоцький В.Т.',
            'Ремезова О.О.',
            'Толкач О.М.',
            'Хоменчук О.В.',
            'Шамрай В.І.',
            'Шлапак В.О.',

            // Факультет економіки та менеджменту
            // Кафедра гуманітарних і соціальних наук
            'Білоус Б.П.',
            'Загурська-Антонюк В. Ф.',
            'Кондратюк Ю.С.',
            'Кругляк М. Е.',
            'Литвинчук О. В.',
            'Муляр В. І.',
            'Панасюк Н. В.',
            'Саннікова С.Б.',
            'Шуляренко Л. І.',

            // Кафедра економіки та підприємництва
            'Біляк Т.О.',
            'Бірюченко С.Ю.',
            'Бужимська К.О.',
            'Валінкевич Н.В.',
            'Виговський В.Г.',
            'Корнійчук А.А.',
            'Кучменко В.О.',
            'Мельник Т.Ю.',
            'Овандер Н.Л.',
            'Оверчук А.В.',
            'Орлова К.Є.',
            'Павлова С.І.',
            'Проценко Н.Б.',
            'Солонінко К.С.',
            'Ткачук Г.Ю.',
            'Травін В.В.',
            'Ущаповський Ю.В.',
            'Юрківський О.Й.',
            'Юшкевич О.О.',

            // Кафедра менеджменту організацій і адміністрування
            'Балковська В.В.',
            'Бурачек І.В.',
            'Вакалюк В.А.',
            'Горшкова Л.О.',
            'Давидюк Ю.В.',
            'Жалінська І.В.',
            'Мілінчук О.В.',
            'Осовський О.А.',
            'Пащенко О.П.',
            'Романів О.Я.',
            'Рудківська А.Ю.',
            'Рудківський О.А.',
            'Тарасюк Г.М.',
            'Царук І.М.',
            'Ярмолюк Д.І.',

            // Кафедра управління персоналом та економіки праці
            'Богоявленська Ю.В.',
            'Желудько Т.В.',
            'Корбут К.Є.',
            'Маслова С.О.',
            'Обіход С.В.',
            'Суходольська А.С.',
            'Ткачук В.О.',
            'Урманов Ф.Ш.',
            'Шпиталенко Г.А.',

            // Факультет інформаційно-комп'ютерних технологій
            // Кафедра інженерії програмного забезпечення
            'Власенко О.В.',
            'Гойчук Д.В.',
            'Грабар О.І.',
            'Граф М.С.',
            'Гришкун Є.О.',
            'Данильченко А.О.',
            'Єфремов Ю.М.',
            'Кондратовець С.Л.',
            'Кравченко С.М.',
            'Кушнір Н.О.',
            'Левківський В.Л.',
            'Лисенко А.В.',
            'Лисогор Ю.І.',
            'Марчук Г.В.',
            'Панішев А.В.',
            'Скачков В.О.',
            'Сугоняк І.І.',
            'Шатківський В.М.',
            'Яремчук С.І.',

            // Кафедра автоматизації та комп'ютерно-інтегрованих технологій ім. проф. Б.Б. Самотокіна
            'Безвесільна О.М.',
            'Богдановський М.В.',
            'Гуменюк А.А.',
            'Добржанський О.О.',
            'Каргополова Н.П.',
            'Кирилович В.А.',
            'Коваль А.В.',
            'Підтиченко О.В.',
            'Сазонов А.Ю.',
            'Ткачук А.Г.',
            'Хильченко Т.В.',
            'Черепанська І.Ю.',
            'Шавурський Ю.О.',

            // Кафедра біомедичної інженерії та телекомунікацій
            'Андреєв О.В.',
            'Бенедицький В.Б.',
            'Бурдейний М.О.',
            'Грек О.В.',
            'Коломієць Р.О.',
            'Коренівська О.Л.',
            'Манойлов В.П.',
            'Мартинчук П.П.',
            'Морозов Д.С.',
            'Нікітчук Т.М.',
            'Полещук І.І.',
            'Хоменко Ж.М.',
            'Хоменко М.Ф.',
            'Ципоренко В.В.',
            'Ципоренко В.Г.',
            'Чухов В.В.',

            // Кафедра комп'ютерної інженерії та кібербезпеки
            'Байлюк Є.М.',
            'Єфіменко А.А.',
            'Казмірчук С.В.',
            'Котенко В.М.',
            'Лобанчикова Н.М.',
            'Меленський В.Д.',
            'Молодецька-Гринчук К.В.',
            'Морозов А.В.',
            'Оринчак І.А.',
            'Пількевич І.А.',
            'Покотило О.А.',
            'Поліщук В.В.',
            'Россінський Ю.М.',
            'Шестаков В.І.',

            // Кафедра метрології та інформаційно-вимірювальної техніки
            'Болотній О.Г.',
            'Воронова Т.С.',
            'Локтікова Т.М.',
            'Лугових О.О.',
            'Петросян Р.В.',
            'Подчашинський Ю.О.',
            'Поліщук О.А.',
            'Тарарака В.Д.',
            'Чепюк Л.О.',

            // Факультет інженерної механіки
            // Кафедра автомобілів і транспортних технологій
            'Бегерський Д.Б.',
            'Бовсунівський І.А.',
            'Вітюк І.В.',
            'Журба О.О.',
            'Ільченко А.В.',
            'Колодницька Р.В.',
            'Кравченко О.П.',
            'Можаровський М.М.',
            'Опанасюк Є.Г.',
            'Рафальський О.І.',
            'Титаренко В.Є.',
            'Тростенюк Ю.І.',
            'Шумляківський В.П.',

            //Кафедра галузевого машинобудування
            'Глембоцька Л.Є.',
            'Мельник О.Л.',
            'Мудревський П.І.',
            'Отаманський В.В.',
            'Райковська Г.О.',
            'Сєров В.В.',
            'Соловйов А.В.',
            'Степчин О.А.',
            'Степчин Я.А.',
            'Шараковський В.М.',
            'Шевченко О.В.',

            // Кафедра прикладної механіки і комп'ютерно-інтегрованих технологій
            'Балицька Н.О.',
            'Виговський Г. М.',
            'Головня В.Д.',
            'Громовий О.А.',
            'Мельничук П.П.',
            'Ночвай В.М.',
            'Полонський Л.Г.',
            'Шостачук А.М.',
            'Штегін О.О.',
            'Юмашев В.Є.',
            'Яновський В.А.',

            // Кафедра фізики та вищої математики
            'Бондарчук В.М.',
            'Давидчук С.П.',
            'Добряков В.Л.',
            'Коваль В.О.',
            'Москвін П.П.',
            'Очич В.М.',
            'Прилипко О.І.',
            'Рудніцький В.А.',

            // Кафедра фізичного виховання та спорту
            'Бабій В.Д.',
            'Засік Г.Б.',
            'Кравчук О.Б.',
            'Крупенін О.М.',
            'Міклуш В.П.',
            'Одноворченко І.В.',
            'Остапенко О.Л.',
            'Острогляд А.Є.',
            'Петренко В.І.',
            'Петренко І.І.',
            'Тамбов В.І.',
            'Цуд І.В.',
            'Шелесько С.П.',

            // Факультет обліку і фінансів
            // Кафедра економічної безпеки, публічного управління та адміністрування
            'Барановська Т.В.',
            'Горай О.С.',
            'Грицишен Д.О.',
            'Дика О.С.',
            'Дикий А.П.',
            'Савіцький В.В.',
            'Свірко С.В.',
            'Сергієнко Л.В.',
            'Тростенюк Т.М.',
            'Яцик І.С.',
            'Яцик С.П.',

            // Кафедра міжнародної економіки
            'Бондарчук В.В.',
            'Каленчук Л.В.',
            'Ксендзук В.В.',
            'Романчук К.В.',
            'Шиманська К.В.',

            // Кафедра обліку і аудиту
            'Безручук С.Л.',
            'Вигівська І.М.',
            'Вольська К.О.',
            'Городиський М.П.',
            'Грабчук І.Л.',
            'Жиглей І.В.',
            'Замула І.В.',
            'Іваненко В.О.',
            'Кучер С.В.',
            'Лаговська О.А.',
            'Лайчук С.М.',
            'Легенчук С.Ф.',
            'Лозинський Д.Л.',
            'Назаренко Т.П.',
            'Супрунова І.В.',
            'Хоменко Г.Ю.',
            'Чижевська Л.В.',
            'Ющак Ж.М.',

            //Кафедра фінансів і кредиту
            'Александрова М.М.',
            'Виговська Н.Г.',
            'Довгалюк В.В.',
            'Дячек С.М.',
            'Коцюбинська Є.Б.',
            'Литвинчук І.В.',
            'Новак О.С.',
            'Петрук О.М.',
            'Прохорчук Н.О.',
        ];

        if (\in_array($message->getText(), $teachers, true)) {
            $answer = $this->teacherService->getSchedule($message->getText());

            return Request::sendMessage([
                'chat_id' => $message->getChat()->getId(),
                'text' => $answer,
                'parse_mode' => 'HTML',
            ]);
        }

        if (($data = $this->searchTextOccurrences($teachers, $message)) !== null) {

            return Request::sendMessage($data);
        }

        $data = [
            'chat_id' => $message->getChat()->getId(),
            'text' => $answer,
            'parse_mode' => 'Markdown',
        ];

        return Request::sendMessage($data);
    }

    /**
     * @param array   $teachers
     * @param Message $message
     *
     * @return array|null
     */
    private function searchTextOccurrences(array $teachers, Message $message): ?array
    {
        $patterns = [];
        foreach ($teachers as $teacher) {
            if (mb_stripos($teacher, $message->getText()) !== false) {
                $patterns[] = [$teacher];
            }
        }
        if (!empty($patterns)) {
            $keyboard = new Keyboard(...$patterns);

            $keyboard->setResizeKeyboard(true)
                ->setOneTimeKeyboard(true)
                ->setSelective(false);

            $data = [
                'chat_id' => $message->getChat()->getId(),
                'text' => 'Виберіть викладача якого ви шукаєте',
                'reply_markup' => $keyboard,
            ];

            return $data;
        }

        return null;
    }
}